; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared3 - mode
	infrared4 - mode
	infrared9 - mode
	spectrograph7 - mode
	spectrograph0 - mode
	infrared5 - mode
	spectrograph10 - mode
	spectrograph1 - mode
	infrared2 - mode
	thermograph8 - mode
	infrared6 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph7)
	(supports instrument0 thermograph8)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared9)
	(supports instrument1 spectrograph10)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared9)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph8)
	(supports instrument2 infrared6)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared5)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
)
(:goal (and
	(pointing satellite0 Star8)
	(have_image Phenomenon6 spectrograph7)
	(have_image Phenomenon6 infrared4)
	(have_image Planet7 spectrograph0)
	(have_image Star8 infrared5)
	(have_image Star9 infrared2)
	(have_image Planet10 infrared5)
	(have_image Planet10 infrared9)
))

)

; plan
1. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 8
5. (take_image satellite0 star9 instrument0 infrared2)
   added: (have_image star9 infrared2)
   goals met: 1 of 8
6. (turn_to satellite0 planet7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet7)
   goals met: 1 of 8
7. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon6 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon6 instrument0 spectrograph7)
   added: (have_image phenomenon6 spectrograph7)
   goals met: 3 of 8
10. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 3 of 8
11. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 3 of 8
12. (turn_to satellite0 groundstation4 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 8
13. (calibrate satellite0 instrument2 groundstation4)
   added: (calibrated instrument2)
   goals met: 3 of 8
14. (turn_to satellite0 phenomenon6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 8
15. (take_image satellite0 phenomenon6 instrument2 infrared4)
   added: (have_image phenomenon6 infrared4)
   goals met: 4 of 8
16. (turn_to satellite0 planet10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet10)
   goals met: 4 of 8
17. (take_image satellite0 planet10 instrument2 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 5 of 8
18. (take_image satellite0 planet10 instrument2 infrared9)
   added: (have_image planet10 infrared9)
   goals met: 6 of 8
19. (turn_to satellite0 star8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star8)
   goals met: 7 of 8
20. (take_image satellite0 star8 instrument2 infrared5)
   added: (have_image star8 infrared5)
   goals met: 8 of 8
